# DirectShapeTypeOptions Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DirectShapeTypeOptions Methods
DirectShapeTypeOptions Class See Also
---
The DirectShapeTypeOptions type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| IsEqualTo | Compare this object with the one supplied as argument. Return true if the options specified by both objects are the same. |
| IsValid | Determines whether a DirectShapeTypeOptions is internally consistent (valid). |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
DirectShapeTypeOptions Class
Autodesk.Revit.DB Namespace